# -*- coding:utf-8 -*- 

arr = [1, 2, 3]
print arr[0]
arr[0] = 50
print arr


# Создаем пустой список
print list()

# Преобразуем строку в список
print list("String")

# Преобразуем кортеж в список
print list((1, 2, 3, 4, 5))

# перечислив все элементы списка внутри квадратных скобок:

arr = [1, "str", 3, "4"]

print arr

# заполнив список поэлементно с помошью метода append( ):

# Создаем пустой список

arr = []

# Добавляем элементl (индекс О)
arr.append(1)

# Добавляем элемент2 (индекс 1)
arr.append("str")

print arr





