# -*- coding:utf-8 -*- 

x = [1,[2,3,4,5]] 
print(len(x)) # 2

print(x[0],x[1][0],x[1][3]) # 1 2 5

y, z = [1,[2,3,4,5]], ['str1', 10, [32,33,34,35]]  # Позиционное присваивание
# Количество элементов должно совпадать
print(len(y)) # 2
print(len(z)) # 3

x, *y, z = [1,2,3,4,5] 

print(x,y,z) # 1 [2, 3, 4] 5

x, *y, z = [1,[2,3,4,5]] 

print(x,y,z) # 1 [] [2, 3, 4, 5]

print(len(z))
print(z[len(z)-1])

a = [1, 3, 8, 7, 9]

print(a[:]) # [1, 3, 8, 7, 9]

print(a[1:]) # [3, 8, 7, 9]

print(a[:3]) # [1, 3, 8]

print(a[::2]) # [1, 8, 9]


print(a[::-1]) # [9, 7, 8, 3, 1]

print(a[:-2]) # [1, 3, 8]

print(a[-2::-1]) # [7, 8, 3, 1]

print(a[1:4:-1]) # []


a[1:3] = [0, 0, 0]
print(a) # [1, 0, 0, 0, 7, 9]

del a[:-3]
print(a) # [0, 7, 9]